#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
azurerm_resource_group.rg-application: Refreshing state... [id=/subscriptions/1a554e78-60c2-442e-b8a9-701b1344a588/resourceGroups/rg-nextjsdockerazure-dev]
azurerm_service_plan.asp-application: Refreshing state... [id=/subscriptions/1a554e78-60c2-442e-b8a9-701b1344a588/resourceGroups/rg-nextjsdockerazure-dev/providers/Microsoft.Web/serverfarms/asp-nextjsdockerazure-dev]
azurerm_storage_account.st-application: Refreshing state... [id=/subscriptions/1a554e78-60c2-442e-b8a9-701b1344a588/resourceGroups/rg-nextjsdockerazure-dev/providers/Microsoft.Storage/storageAccounts/stnextjsdockerazuredev]
azurerm_storage_container.app-logs-container: Refreshing state... [id=https://stnextjsdockerazuredev.blob.core.windows.net/app-logs-nextjsdockerazure-dev]
azurerm_linux_web_app.webapp-application: Refreshing state... [id=/subscriptions/1a554e78-60c2-442e-b8a9-701b1344a588/resourceGroups/rg-nextjsdockerazure-dev/providers/Microsoft.Web/sites/app-nextjsdockerazure-dev]
azurerm_role_assignment.role_pull_image: Refreshing state... [id=/subscriptions/1a554e78-60c2-442e-b8a9-701b1344a588/resourcegroups/rg-jshinevar-shared-001/providers/Microsoft.ContainerRegistry/registries/jshinevar/providers/Microsoft.Authorization/roleAssignments/b36c4840-1b46-9b22-c9c2-8fc359110262]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.azurerm_storage_account_blob_container_sas.sas-logs will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_storage_account_blob_container_sas" "sas-logs" {
      + connection_string = (sensitive value)
      + container_name    = "app-logs-nextjsdockerazure-dev"
      + expiry            = (known after apply)
      + id                = (known after apply)
      + sas               = (sensitive value)
      + start             = (known after apply)

      + permissions {
          + add    = false
          + create = false
          + delete = true
          + list   = true
          + read   = true
          + write  = true
        }

      + timeouts {
          + read = (known after apply)
        }
    }

  # azurerm_linux_web_app.webapp-application will be updated in-place
  ~ resource "azurerm_linux_web_app" "webapp-application" {
        id                                = "/subscriptions/1a554e78-60c2-442e-b8a9-701b1344a588/resourceGroups/rg-nextjsdockerazure-dev/providers/Microsoft.Web/sites/app-nextjsdockerazure-dev"
        name                              = "app-nextjsdockerazure-dev"
        tags                              = {}
        # (20 unchanged attributes hidden)

      ~ logs {
            # (2 unchanged attributes hidden)

          ~ application_logs {
                # (1 unchanged attribute hidden)

              ~ azure_blob_storage {
                  ~ sas_url           = (sensitive) -> (sensitive)
                    # (2 unchanged attributes hidden)
                }
            }

          ~ http_logs {
              + azure_blob_storage {
                  + retention_in_days = 30
                  + sas_url           = (sensitive value)
                }

              - file_system {
                  - retention_in_days = 30 -> null
                  - retention_in_mb   = 35 -> null
                }
            }
        }

      ~ site_config {
            # (23 unchanged attributes hidden)

          ~ application_stack {
              + docker_image     = "jshinevar.azurecr.io/nextjsdockerazure"
              + docker_image_tag = "latest"
            }
        }

        # (2 unchanged blocks hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @jshinevar, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform Pull Request`*